In [1]:
print("hello")

hello

In [1]:
import pandas as pd

In [ ]:
my_dic = {
    'name':["ayman" , None , "ali" ,"ayman"],
    'Age' :[20,25,22,None],
    'City' :["giza" , "cairo" , None, "cairo"]
}


df = pd.DataFrame(my_dic)
df

    name   Age   City
0  ayman  20.0   giza
1   None  25.0  cairo
2    ali  22.0   None
3  ayman   NaN  cairo

In [9]:
df["salary"] = [1000,2200,5000,4000]
df.head()

    name  Age   City  salary
0  ayman   20   giza    1000
1  ahmed   25  cairo    2200
2    ali   22  cairo    5000
3  ayman   18  cairo    4000

In [ ]:
df['name']

0    20
1    25
2    22
3    18
Name: Age, dtype: int64

In [17]:
df['Age']

0    20
1    25
2    22
3    18
Name: Age, dtype: int64

In [23]:
df['City'].fillna(df['City'].mode()[0],inplace=True)
df

    name   Age   City
0  ayman  20.0   giza
1   None  25.0  cairo
2    ali  22.0  cairo
3  ayman   NaN  cairo

In [35]:
data = pd.read_csv('employees.csv')
data

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30
5   6      Eva Green         HR   41   54000   2017-04-22
6   7     Mike Davis    Finance   50   90000   2016-08-19
7   8   Linda Taylor         IT   26   64000   2022-02-10
8   9   James Wilson  Marketing   38   70000   2020-09-08
9  10    Sarah Adams         HR   30   55000   2021-03-18

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     object
 2   Department    10 non-null     object
 3   Age           10 non-null     int64
 4   Salary        10 non-null     int64
 5   Joining_Date  10 non-null     object
dtypes: int64(3), object(3)
memory usage: 612.0+ bytes

In [34]:
data.describe()

             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  35.300000  68300.000000
std     3.02765   7.958922  13106.826042
min     1.00000  26.000000  50000.000000
25%     3.25000  29.250000  57250.000000
50%     5.50000  33.000000  69000.000000
75%     7.75000  40.250000  74250.000000
max    10.00000  50.000000  90000.000000

In [29]:
data[data["Department"] == "HR"]

   ID         Name Department  Age  Salary Joining_Date
0   1     John Doe         HR   28   50000   2020-05-21
5   6    Eva Green         HR   41   54000   2017-04-22
9  10  Sarah Adams         HR   30   55000   2021-03-18

In [ ]:
data.groupby('Department')['Salary'].mean()

Department
Finance      87500.000000
HR           53000.000000
IT           70333.333333
Marketing    69000.000000
Name: Salary, dtype: float64

In [ ]:
data['Salary_after_raise'] = data['Salary'] * 1.05
data

   ID           Name Department  Age  Salary Joining_Date  Salary_after_raise
0   1       John Doe         HR   28   50000   2020-05-21             52500.0
1   2     Jane Smith         IT   34   75000   2019-06-12             78750.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15             89250.0
3   4    Alice White         IT   29   72000   2021-01-04             75600.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30             71400.0
5   6      Eva Green         HR   41   54000   2017-04-22             56700.0
6   7     Mike Davis    Finance   50   90000   2016-08-19             94500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10             67200.0
8   9   James Wilson  Marketing   38   70000   2020-09-08             73500.0
9  10    Sarah Adams         HR   30   55000   2021-03-18             57750.0

In [38]:
sorted_data = data.sort_values('Age' , ascending=True)
sorted_data

   ID           Name Department  Age  Salary Joining_Date  Salary_after_raise
7   8   Linda Taylor         IT   26   64000   2022-02-10             67200.0
0   1       John Doe         HR   28   50000   2020-05-21             52500.0
3   4    Alice White         IT   29   72000   2021-01-04             75600.0
9  10    Sarah Adams         HR   30   55000   2021-03-18             57750.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30             71400.0
1   2     Jane Smith         IT   34   75000   2019-06-12             78750.0
8   9   James Wilson  Marketing   38   70000   2020-09-08             73500.0
5   6      Eva Green         HR   41   54000   2017-04-22             56700.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15             89250.0
6   7     Mike Davis    Finance   50   90000   2016-08-19             94500.0

In [39]:
data['Department'].value_counts()

Department
HR           3
IT           3
Finance      2
Marketing    2
Name: count, dtype: int64

In [41]:
data['Joining_Date'] = pd.to_datetime(data["Joining_Date"])
data

   ID           Name Department  Age  Salary Joining_Date  Salary_after_raise
0   1       John Doe         HR   28   50000   2020-05-21             52500.0
1   2     Jane Smith         IT   34   75000   2019-06-12             78750.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15             89250.0
3   4    Alice White         IT   29   72000   2021-01-04             75600.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30             71400.0
5   6      Eva Green         HR   41   54000   2017-04-22             56700.0
6   7     Mike Davis    Finance   50   90000   2016-08-19             94500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10             67200.0
8   9   James Wilson  Marketing   38   70000   2020-09-08             73500.0
9  10    Sarah Adams         HR   30   55000   2021-03-18             57750.0

In [42]:
data[data['Joining_Date'] > "2020-01-01"]

   ID          Name Department  Age  Salary Joining_Date  Salary_after_raise
0   1      John Doe         HR   28   50000   2020-05-21             52500.0
3   4   Alice White         IT   29   72000   2021-01-04             75600.0
7   8  Linda Taylor         IT   26   64000   2022-02-10             67200.0
8   9  James Wilson  Marketing   38   70000   2020-09-08             73500.0
9  10   Sarah Adams         HR   30   55000   2021-03-18             57750.0

In [44]:
data.to_csv('new_data.csv')